<!DOCTYPE html>
<html lang="ru">
    <head>
        <meta charset=utf-8">
        <title>Дивизия</title>
        <link rel="stylesheet" href="/styles/base.css"/>
        <link rel="stylesheet" href="/styles/division.css"/>
        <link rel="stylesheet" href="/styles/menu.css"/>
    </head>
    <body>
        <div id="container">
            <div id="navigation">
                <?php
                    include_once($_SERVER['DOCUMENT_ROOT']."/mobile.php");
                ?>
                <div id="pages">
                    <a href="/index.php">Главная</a>
                    <div id="divider"></div>
                    <a href="/pages/about.php">О музее</a>
                    <div id="divider"></div>
                    <a href="/pages/activity.php">Деятельность музея</a>
                    <div id="divider"></div>
                    <a href="#" class="active">Дивизия</a>
                    <div id="divider"></div>
                    <a href="/pages/contacts.php">Контакты</a>
                    <div id="divider"></div>
                    <a href="/pages/sources.php">Список литературы</a>
                </div>
            </div>
            <div id="content">
                <div id="bridge">
                    <img src="/images/main_stand.jpg" alt="Фон">
                    <p>
                        На этой странице подробно описаны оба формирования 154-ой Ульяновской стрелковой дивизии
                    </p>
                </div>
                <div id="div_stand">
                    <img src="/images/division/stand.jpg" alt="Стенд">
                </div>
                <hr>
                <div id="div_first">
                    <h1>154-я Ульяновская стрелковая дивизия (1-го формирования)</h1>
                    <p>
                        Эта дивизия участвовала в боевых действиях Великой Отечечественной войны, была сформирована в ноябре 1940 году. Состав дивизии: 437, 473, 510 стрелковые полка, 571 артиллерийский полк, 580 гаубичный артиллерийский полк, 143 отдельный изтребительно-противотанковый дивизион, 278 зенитная артиллерийская батарея, 239 разведытавательная рота, 212 саперный батальон 292 отдельная рота связи, 183 медико-санитарный батальон, 173(154) отдельная рота химзащита, 182 автотранспортный батальон, 350 полевая хлебопекарня, 122 дивизионный ветеринарный лазарет, 154 дивизионная артиллерийская мастерска, 670 полевая почтовая станция, 539 полевая касса Госбанка.
                    </p>
                    <br>
                    <p>
                        В конце августа 1941 года 154-я стрелковая дивизия была выведена на восстановление в район 12-15 км западнее города Брянска. На 1 сентября дивизия насчитывала 3 071 чел., два 45 мм ор., 36 пулемётов. После доукомплектования дивизии была поставлена задача занять, оборону фронтом на восток, и по западному берегу реки Десна прикрыть город Брянск, и тылы 50-й Армии.
                    </p>
                    <img src="/images/division/plate.jpg" alt="Табличка">
                    <p>
                        Из-за начавшегося 30.09.41 г. наступления 2 Тгр к 06.10.41 части Брянского фронта оказались глубоко обойдены и рассечены на части. Командующий Брянским фронтом генерал Еременко приказал частям фронта «перевернуть» фронт и прорываться на восток. Подразделения 437-го полка дивизии должны были обеспечить отход своей 50-й армии.
                    </p>
                </div>
                <hr>
                <div id="div_second">
                    <h1>154-я Ульяновская стрелковая дивизия (2-го формирования)</h1>
                    <p>
                        В середине мая на станции Манчалово (14 км. западнее г. Ржев) на базе 82-й морской и 130-й отдельной стрелковых бригад была сформирована 154-я стрелковая дивизия, а полковник К. Н. Никулин утвержден ее командиром. До 12 июля 1943 года дивизия в составе 68-й армии находилась в резерве Ставки ВГК, затем выступила маршем и к 24 июля сосредоточилась в районе юго-восточнее города Дорогобуж (нас. пункты Кряково, Марково, Афонино). С 4 августа 1943 года она вошла в подчинение 5-й армии Западного фронта и участвовала в Смоленской и Ельнинско-Дорогобужской наступательных операциях. после этих боев имея большие потери, она 10 сентября выведена в резерв Ставки ВГК для пополнения в посёлок Киреевка Тульской области. 5 октября дивизия была направлена в район города Великие Луки. С 17 октября она вошла в состав 4-й ударной армии Калининского фронта (с 20 октября — 1-го Прибалтийского) и участвовала в боях юго-западнее города Невель и на витебском направлении в Невельской и Городокской наступательных операциях, после чего до июня 1944 года она находилась в обороне северо-западнее Витебска на рубеже Подмишневье, Товстыки, Дворец.
                    </p>
                    <img src="/images/division/team154.jpg" alt="Дивизия">
                    <p>
                        С 1 июня 1944 года дивизия вошла в 6-ю гвардейскую армию и участвовала в Белорусской, Витебско-Оршанской, Полоцкой и Режицко-Двинской и Шяуляйской наступательных операциях, в преследовании противника по правому берегу реки Западная Двина и освобождении города Двинск. В дальнейшем части дивизии вели бои в Латвии, участвуя в Прибалтийской, Рижской и Мемельской наступательных операциях. С 8 декабря дивизия вошла во 2-ю гвардейскую армию 3-го Белорусского фронта и была переброшена в Восточную Пруссию. С 15 января 1945 года она перешла в наступление и участвовала в Восточно-Прусской, Инстербургско-Кенигсбергской и Земландской наступательных операциях, в боях под городом Гольдап и в овладении городом Бартенштайн, в разгроме земландской группировки противника. За бои при разгроме группировки противника юго-западнее Кенигсберга дивизия была награждена орденом Суворова 2-й степени.
                    </p>
                    <br>
                    <p>
                        В феврале 1946 года 154-я стрелковая ордена Суворова дивизия была расформирована.
                    </p>
                </div>
            </div>
        </div>
        <div class="footer">
            <center>Сайт создан в 2022 году для МБОУ СШ №15 г.Ульяновск.<br> Создал сайт студент УлГТУ Зюзин Георгий.</center>
        </div>
    </body>
</html>
